import TagsAndReads from "../blog/ReadmoreFavarite";
import FavoriteArticles from "./favoriteArticles";
import Image from 'next/image';



// Start InterFace And App demo Data
interface readMores{
    title:string,
    text:string,
    url:string
}

interface favariteTag{
    text: string,
    url: string
}



const readMores: readMores[] = [
    {
        title:"ساختار پروژه و مراحل مدیریت آن را بشناسید",
        text:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،......  ",
        url:"/"
    },
    {
        title:"ساختار پروژه و مراحل مدیریت آن را بشناسید",
        text:" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،...... ",
        url:"/"
    },
    {
        title:"ساختار پروژه و مراحل مدیریت آن را بشناسید",
        text:" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،...... ",
        url:"/"
    },
    {
        title:"ساختار پروژه و مراحل مدیریت آن را بشناسید",
        text:" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،...... ",
        url:"/"
    },
    {
        title:"ساختار پروژه و مراحل مدیریت آن را بشناسید",
        text:" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، ......",
        url:"/"
    }
]

const favariteTag:favariteTag[] = [
    {
        text:"مدیریت تسک",
        url :"/"
    },
    {
        text:"تسک",
        url :"/"
    },
    {
        text:"مدیریت تسک",
        url :"/"
    },
    {
        text:"تسک",
        url :"/"
    },
    {
        text:"مدیریت تسک",
        url :"/"
    },
]


const PostBody = () => {
    return (
        <>
        <main className="flex items-center mt-10">
            <TagsAndReads className="sm:d-none" favariteTag={favariteTag} readMores={readMores}/>
            <article className="w-full flex items-center flex-col w-2/3 px-3 py-10">
                <Image 
                src="/images/blog/Project-managment.png" 
                alt="عکس برای مقاله" width={850} height={400}
                />
                <div className="w-full py-6 px-8">
                    <h1 className="text-3xl font-bold mb-4">نرم افزار مدیریت کسب و کار مناسب چه ویژگی هایی دارد؟</h1>
                    <p className="text-justify">
                        بسیاری از وظایف مدیران در پروژه های مختلف، به تمرکز بالا و دقت صددرصدی نیاز دارد.
                        استفاده از امکاناتی که رشد تکنولوژی در اختیار ما قرار داده است، به افزایش نظم در 
                        برنامه ریزی مدیران و افزایش بهره وری پروژه ها کمک فراوانی می کند. نرم افزار مدیریت کسب و کار 
                        از جمله ابزارهای نوینی است که برای برنامه ریزی مدون کسب و کار استفاده می شود و شامل بخش هایی مانند مدیریت وظایف، 
                        مدیریت ارتباطات، ارتباط با مشتریان و... است. <br />
                        ویژگی های نرم افزار مدیریت کسب و کار
                    </p>
                </div>
                <div className="w-full pb-3 px-8">
                    <h3 className="text-normal font-bold">مزایای نرم افزار مدیریت کسب و کار</h3>
                    <p className="text-justify">
                        یکی از ابزارهای مهم مدیریتی برای سازماندهی و آگاهی از عملکرد کارکنان یک 
                        مجموعه، نرم افزار مدیریت کسب و کار است. این نرم افزار علاوه بر کاهش هزینه ها 
                        و محیط کاربری آسان، در مراحل مختلف برنامه ریزی، شروع، اجرای صحیح، آگاهی از گزارش 
                        عملکرد کارکنان، پیشرفت پروژه، مقدار زمان مناسب برای انجام یک کار و ... به کمک مدیران 
                        می آید. به همین دلیل آگاهی از امکانات و چگونگی عملکرد این ابزار برای پیشرفت پروژه ها ضروری است.
                    </p>
                </div>
                <div className="w-full pb-3 px-8">
                    <h3 className="text-normal font-bold">مزایای استفاده از نرم افزار مدیریت کسب و کار برای مدیران عبارتند از:</h3>
                    <ul className="list-disc pr-6 py-3">
                        <li>سازماندهی فعالیت ها</li>
                        <li>هدایت اعضای سازمانی و افراد زیرمجموعه خود</li>
                        <li>برنامه ریزی صحیح برای اهداف پروژه ها</li>
                        <li>کنترل منابع مختلف مالی، طبیعی، انسانی و تکنولوژیکی</li>
                    </ul>

                </div>
                <div className="w-full pb-3 px-8">
                    <h3 className="text-normal font-bold">مدیریت وظایف فردی و گروهی</h3>
                    <p className="text-justify">
                        مدیریت وظایف یکی از مهم ترین مسئولیت های مدیران کسب و کار است. نرم افزارهای 
                        مدیریت کسب و کار ایده آل دارای امکاناتی برای تخصیص وظایف به افراد در تیم های کاری هستند و مدیر 
                        می تواند با انتخاب یک بازه زمانی مشخص برای انجام دادن آن وظایف، برنامه ریزی مناسبی برای دستیابی 
                        به اهداف پروژه داشته باشد. مدیران با استفاده از این قابلیت می توانند گزارش پیشرفت لحظه به لحظه 
                        اعضای سازمان را مشاهده کنند و در صورت اخلال در برنامه ها، تصمیم مناسبی بگیرند. <br />
                        همچنین با استفاده از این قابلیت، امکان انجام یک وظیفه به صورن مشارکتی و برای تسریع در روند 
                        اهداف پروژه وجود دارد و گزارش پیشرفت هرکدام از اعضا به صورت روزانه و بر اساس عملکرد آن ها 
                        کاملا در اختیار مدیر قرار می گیرد. <br />
                        مدیریت پروژه: قابلیتی کاربردی در مدیریت کسب و کار
                    </p>
                </div>
            </article>
        </main>
        <section>
            <h2 className="font-black m-6">شاید به این مقالات هم علاقمند شوید</h2>
            <FavoriteArticles />
        </section>
        </>
    )
}
export default PostBody
